/*
Составить описание класса многочленов от одной переменной, задаваемых степенью 
многочлена и массивом коэффицентов. Предусмотреть методы для вычисления значения 
многочлена для заданного аргумента. операции сложения, вычитания и умножения многочленов
с получением нового объекта-многочлена, вывод на экран описания многочлена.

Написать программу, демонстрирующую работу с этим классом. Программа должна
содержать меню, позволяющее осуществить проверку всех методов класса.
*/
#include <iostream>

using std::cin;
using std::cout;

class Polynomial {
    int pow;

public:
    void input();
    void +();
    void -();
    void *();
    void output();


}

void Polynomial::input(){


}

void Polynomial::sum(){

}

void Polynomial::neg(){

}

void Polynomial::sol(){

}

void Polynomial::output(){

}

int main(){


    return 0;
}